cmjang/CtrBoard-H7_IMU_Altitude/AC6_Code/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Driver/USBD_STM32H7xx.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2023 Arm Limited (or its affiliates).
 * All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 *
 * $Date:        27. February 2023
 * $Revision:    V1.6
 *
 * Driver:       Driver_USBD0/1
 *
 * Configured:   via CubeMX
 * Project:      USB High/Full/Low-Speed Device Driver for ST STM32H7xx
 * -------------------------------------------------------------------------- */

/*! \page stm32h7_usbd USB Device

# Revision History

- Version 1.6
  - Made variable state volatile (solved potential LTO problems)
- Version 1.5
  - Added support for VBUS sensing
- Version 1.4
  - Updated documentation
  - Corrected USBD_GetFrameNumber function
- Version 1.3
  - Updated to be compliant with HAL drivers version 1.5.0
- Version 1.2
  - Updated USBD_EndpointConfigure function to check that maximum packet
  - size requested fits into configured FIFO (compile time configured)
- Version 1.1
  - Corrected transmitted count for non-control IN endpoints
- Version 1.0
  - Initial release

# Capabilities

This driver supports USB **High**, **Full** and **Low** speeds.

# Instances

Hardware resource relating to driver instance is shown in the table below:

Driver Instance | Hardware Resource
:---------------|:-----------------:
Driver_USBD0    | USB_OTG_FS
Driver_USBD1    | USB_OTG_HS

# Configuration

## STM32CubeMX

The USB Device driver requires:
  - **USB peripheral clock** at **48 MHz**
  - **USB_OTG_FS** or **USB_OTG_HS** peripheral configured as **Device_Only**
  - **USB DP**, **DM** and **VBUS pins** or **USB HS ULPI pins**

# STM32H743I-EVAL Board Configuration

These settings are relevant for this board, for different board please refer to the board
schematic for proper configuration.

Link to [STM32H743I-EVAL board schematic](https://www.st.com/resource/en/schematic_pack/mb1246-h743-e03_schematic.pdf).

## STM32CubeMX

Required peripherals for the **STM32H743I-EVAL** board are listed in the table below:

Peripheral  | Mode                         | Description
:----------:|:----------------------------:|:-----------
USB_OTG_FS  | Device_Only                  | USB Controller
PA9         | Input mode                   | USB VBUS Pin
PA11        | Alternate Function Push Pull | USB DM Pin
PA12        | Alternate Function Push Pull | USB DP Pin
USB_OTG_HS  | Device_Only                  | USB Controller
PA3         | Alternate Function Push Pull | ULPI D0 Pin
PA5         | Alternate Function Push Pull | ULPI CLK Pin
PB0         | Alternate Function Push Pull | ULPI D1 Pin
PB1         | Alternate Function Push Pull | ULPI D2 Pin
PB5         | Alternate Function Push Pull | ULPI D7 Pin
PB10        | Alternate Function Push Pull | ULPI D3 Pin
PB11        | Alternate Function Push Pull | ULPI D4 Pin
PB12        | Alternate Function Push Pull | ULPI D5 Pin
PB13        | Alternate Function Push Pull | ULPI D6 Pin
PC0         | Alternate Function Push Pull | ULPI STP Pin
PH4         | Alternate Function Push Pull | ULPI NXT Pin
PI11        | Alternate Function Push Pull | ULPI DIR Pin

\note All settings have to be configured as described in the procedure below. Important settings,
      typically the ones different from default, are emphasized in **bold**.

### Pinout & Configuration tab

  1. In the **Pinout view** window click on a pin and select it's functionality:
        Pin      | Functionality
        :--------|:-------------:
        PA9      | **USB_OTG_FS_VBUS** (required for VBUS sensing)
        PA11     | **USB_OTG_FS_DM**
        PA12     | **USB_OTG_FS_DP**
        PA3      | **USB_OTG_HS_ULPI_D0**
        PA5      | **USB_OTG_HS_ULPI_CLK**
        PB0      | **USB_OTG_HS_ULPI_D1**
        PB1      | **USB_OTG_HS_ULPI_D2**
        PB5      | **USB_OTG_HS_ULPI_D7**
        PB10     | **USB_OTG_HS_ULPI_D3**
        PB11     | **USB_OTG_HS_ULPI_D4**
        PB12     | **USB_OTG_HS_ULPI_D5**
        PB13     | **USB_OTG_HS_ULPI_D6**
        PC0      | **USB_OTG_HS_ULPI_STP**
        PH4      | **USB_OTG_HS_ULPI_NXT**
        PI11     | **USB_OTG_HS_ULPI_DIR**
       \n

  2. Under **Categories**: **Connectivity** select **USB_OTG_FS**:

     __Mode__:
       - Mode: **Device_Only**
       - Activate_VBUS: **VBUS sensing**
       - Activate_SOF: unchecked

     __Configuration__:
       - Parameter Settings: not used
       - User Constants: not used
       - NVIC Settings: configured in later step (under Category: System Core: NVIC)
       - GPIO Settings:
            Pin Name | Signal on Pin       | Pin Context..| GPIO output..| GPIO mode                     | GPIO Pull-up/Pull..| Maximum out..| Fast Mode | User Label
            :--------|:-------------------:|:------------:|:------------:|:-----------------------------:|:------------------:|:------------:|:---------:|:----------:
            PA9      | USB_OTG_FS_VBUS     | n/a          | n/a          | Input mode                    | No pull-up and no..| n/a          | n/a       | .
            PA11     | USB_OTG_FS_DM       | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PA12     | USB_OTG_FS_DP       | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
       \n

  3. Under **Categories**: **Connectivity** select **USB_OTG_HS**:

     __Mode__:
       - External Phy: **Device_Only**
       - Internal FS Phy: Disable
       - Activate_SOF: unchecked
       - Activate_VBUS: Disable

     __Configuration__:
       - Parameter Settings: not used
       - User Constants: not used
       - NVIC Settings: configured in later step (under Category: System Core: NVIC)
       - GPIO Settings:
            Pin Name | Signal on Pin       | Pin Context..| GPIO output..| GPIO mode                     | GPIO Pull-up/Pull..| Maximum out..| Fast Mode | User Label
            :--------|:-------------------:|:------------:|:------------:|:-----------------------------:|:------------------:|:------------:|:---------:|:----------:
            PA3      | USB_OTG_HS_ULPI_D0  | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PA5      | USB_OTG_HS_ULPI_CLK | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PB0      | USB_OTG_HS_ULPI_D1  | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PB1      | USB_OTG_HS_ULPI_D2  | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PB5      | USB_OTG_HS_ULPI_D7  | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PB10     | USB_OTG_HS_ULPI_D3  | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PB11     | USB_OTG_HS_ULPI_D4  | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PB12     | USB_OTG_HS_ULPI_D5  | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PB13     | USB_OTG_HS_ULPI_D6  | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PC0      | USB_OTG_HS_ULPI_STP | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PH4      | USB_OTG_HS_ULPI_NXT | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PI11     | USB_OTG_HS_ULPI_DIR | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
       \n

