cmjang/CtrBoard-H7_IMU_Altitude/AC6_Code/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Driver/USBD_STM32H7xx.c
  4. Under **Categories**: **System Core** select **NVIC**:

     __Configuration__:
       - NVIC:
            NVIC Interrupt Table              | Enabled       | Preemption Priority | Sub Priority
            :---------------------------------|:-------------:|:-------------------:|:------------:
            USB On The Go HS global interrupt | **checked**   | 0                   | 0
            USB On The Go FS global interrupt | **checked**   | 0                   | 0
       - Code generation:
            Enabled interrupt table           | Select for..  | Generate Enable in..| Generate IRQ h.. | Call HAL handler
            :---------------------------------|:-------------:|:-------------------:|:----------------:|:----------------:
            USB On The Go HS global interrupt | unchecked     | checked             | **unchecked**    | n/a
            USB On The Go FS global interrupt | unchecked     | checked             | **unchecked**    | n/a

### Clock Configuration tab

  1. Configure **To USB (MHz)**: **48**

### Project Manager tab

  1. Under **Advanced Settings**:

     __Generated Function Calls__:
        Generate Code | Function Name               | Peripheral Inst..| Do not generate ..| Visibility (Static)
        :-------------|:---------------------------:|:----------------:|:-----------------:|:-------------------:
        checked       | MX_USB_OTG_FS_PCD_Init      | USB_OTG_FS       | **checked**       | checked
        checked       | MX_USB_OTG_HS_PCD_Init      | USB_OTG_HS       | **checked**       | checked

### Generate Code

Generate source code by clicking on the **GENERATE CODE** button on the toolbar.
*/

/*! \cond */

#include "OTG_STM32H7xx.h"
#include "USBD_STM32H7xx.h"

#include "stm32h7xx.h"

#include "string.h"

#if (OTG_FS_DEVICE_USED == 1)
#ifndef USBD_FS_MAX_ENDPOINT_NUM
#define USBD_FS_MAX_ENDPOINT_NUM   (8U)
#endif
#if    (USBD_FS_MAX_ENDPOINT_NUM > 8U)
#error  Too many Endpoints, maximum IN/OUT Endpoint pairs that this driver supports is 8 !!!
#endif

// FIFO sizes in bytes (total available memory for FIFOs is 4 kB)
#ifndef OTG_FS_RX_FIFO_SIZE
#define OTG_FS_RX_FIFO_SIZE        (1024U)
#endif
#ifndef OTG_FS_TX0_FIFO_SIZE
#define OTG_FS_TX0_FIFO_SIZE       (64U)
#endif
#ifndef OTG_FS_TX1_FIFO_SIZE
#define OTG_FS_TX1_FIFO_SIZE       (1024U)
#endif
#ifndef OTG_FS_TX2_FIFO_SIZE
#define OTG_FS_TX2_FIFO_SIZE       (512U)
#endif
#ifndef OTG_FS_TX3_FIFO_SIZE
#define OTG_FS_TX3_FIFO_SIZE       (256U)
#endif
#ifndef OTG_FS_TX4_FIFO_SIZE
#define OTG_FS_TX4_FIFO_SIZE       (256U)
#endif
#ifndef OTG_FS_TX5_FIFO_SIZE
#define OTG_FS_TX5_FIFO_SIZE       (256U)
#endif
#ifndef OTG_FS_TX6_FIFO_SIZE
#define OTG_FS_TX6_FIFO_SIZE       (256U)
#endif
#ifndef OTG_FS_TX7_FIFO_SIZE
#define OTG_FS_TX7_FIFO_SIZE       (256U)
#endif
#ifndef OTG_FS_TX8_FIFO_SIZE
#define OTG_FS_TX8_FIFO_SIZE       (192U)
#endif
#endif

#if (OTG_HS_DEVICE_USED == 1)
#ifndef OTG_HS_IN_FS
#define OTG_HS_IN_FS               (0U)
#endif

#ifndef USBD_HS_MAX_ENDPOINT_NUM
#define USBD_HS_MAX_ENDPOINT_NUM   (8U)
#endif
#if    (USBD_HS_MAX_ENDPOINT_NUM > 8U)
#error  Too many Endpoints, maximum IN/OUT Endpoint pairs that this driver supports is 8 !!!
#endif

// FIFO sizes in bytes (total available memory for FIFOs is 4 kB)
#ifndef OTG_HS_RX_FIFO_SIZE
#define OTG_HS_RX_FIFO_SIZE        (1024U)
#endif
#ifndef OTG_HS_TX0_FIFO_SIZE
#define OTG_HS_TX0_FIFO_SIZE       (64U)
#endif
#ifndef OTG_HS_TX1_FIFO_SIZE
#define OTG_HS_TX1_FIFO_SIZE       (1024U)
#endif
#ifndef OTG_HS_TX2_FIFO_SIZE
#define OTG_HS_TX2_FIFO_SIZE       (512U)
#endif
#ifndef OTG_HS_TX3_FIFO_SIZE
#define OTG_HS_TX3_FIFO_SIZE       (256U)
#endif
#ifndef OTG_HS_TX4_FIFO_SIZE
#define OTG_HS_TX4_FIFO_SIZE       (256U)
#endif
#ifndef OTG_HS_TX5_FIFO_SIZE
#define OTG_HS_TX5_FIFO_SIZE       (256U)
#endif
#ifndef OTG_HS_TX6_FIFO_SIZE
#define OTG_HS_TX6_FIFO_SIZE       (256U)
#endif
#ifndef OTG_HS_TX7_FIFO_SIZE
#define OTG_HS_TX7_FIFO_SIZE       (256U)
#endif
#ifndef OTG_HS_TX8_FIFO_SIZE
#define OTG_HS_TX8_FIFO_SIZE       (192U)
#endif
#endif

// USBD Driver *****************************************************************

#define ARM_USBD_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1,6)

// Driver Version
static const ARM_DRIVER_VERSION usbd_driver_version = { ARM_USBD_API_VERSION, ARM_USBD_DRV_VERSION };

// Driver Capabilities
static const ARM_USBD_CAPABILITIES usbd_fs_driver_capabilities = {
#ifdef MX_USB_OTG_FS_VBUS_Pin
  1U,   // VBUS Detection
  1U,   // Event VBUS On
  1U    // Event VBUS Off
#else
  0U,   // VBUS Detection
  0U,   // Event VBUS On
  0U    // Event VBUS Off
#endif
#if (defined(ARM_USBD_API_VERSION) && (ARM_USBD_API_VERSION >= 0x202U))
, 0U    // Reserved
#endif
};

// Driver Capabilities
static const ARM_USBD_CAPABILITIES usbd_hs_driver_capabilities = {
  1U,   // VBUS Detection
  1U,   // Event VBUS On
  1U    // Event VBUS Off
#if (defined(ARM_USBD_API_VERSION) && (ARM_USBD_API_VERSION >= 0x202U))
, 0U    // Reserved
#endif
};

#define EP_NUM(ep_addr)         ((ep_addr) & ARM_USB_ENDPOINT_NUMBER_MASK)
#define EP_ID(ep_addr)          ((EP_NUM(ep_addr) * 2U) + (((ep_addr) >> 7) & 1U))

#if (OTG_FS_DEVICE_USED == 1)
extern PCD_HandleTypeDef hpcd_USB_OTG_FS;

// Endpoints runtime information
static  ENDPOINT_t usbd_fs_ep[(USBD_FS_MAX_ENDPOINT_NUM + 1U) * 2U];
static             USBD_INFO_t  usbd_fs_info;
static             uint32_t     usbd_fs_setup_packet[2];

static const USBD_RESOURCES_t USBD_FS_Resources = {
  &hpcd_USB_OTG_FS,
  &usbd_fs_info,
   usbd_fs_ep,
   usbd_fs_setup_packet,
  &otg_fs_role,
   OTG_FS_IRQn,
   USBD_FS_MAX_ENDPOINT_NUM,
   0,
   OTG_FS_RX_FIFO_SIZE,
  {OTG_FS_TX0_FIFO_SIZE,
   OTG_FS_TX1_FIFO_SIZE,
   OTG_FS_TX2_FIFO_SIZE,
   OTG_FS_TX3_FIFO_SIZE,
   OTG_FS_TX4_FIFO_SIZE,
   OTG_FS_TX5_FIFO_SIZE,
   OTG_FS_TX6_FIFO_SIZE,
   OTG_FS_TX7_FIFO_SIZE,
   OTG_FS_TX8_FIFO_SIZE}
};
#endif

#if (OTG_HS_DEVICE_USED == 1)
extern PCD_HandleTypeDef hpcd_USB_OTG_HS;

// Endpoints runtime information
static  ENDPOINT_t usbd_hs_ep[(USBD_HS_MAX_ENDPOINT_NUM + 1U) * 2U];
static             USBD_INFO_t  usbd_hs_info;
static             uint32_t     usbd_hs_setup_packet[2];

static const USBD_RESOURCES_t USBD_HS_Resources = {
  &hpcd_USB_OTG_HS,
  &usbd_hs_info,
   usbd_hs_ep,
   usbd_hs_setup_packet,
  &otg_hs_role,
   OTG_HS_IRQn,
   USBD_HS_MAX_ENDPOINT_NUM,
   0,
   OTG_HS_RX_FIFO_SIZE,
  {OTG_HS_TX0_FIFO_SIZE,
   OTG_HS_TX1_FIFO_SIZE,
   OTG_HS_TX2_FIFO_SIZE,
   OTG_HS_TX3_FIFO_SIZE,
   OTG_HS_TX4_FIFO_SIZE,
   OTG_HS_TX5_FIFO_SIZE,
   OTG_HS_TX6_FIFO_SIZE,
   OTG_HS_TX7_FIFO_SIZE,
   OTG_HS_TX8_FIFO_SIZE}
};
#endif

/**
  \fn          const USBD_RESOURCES_t * USBD_Resources (PCD_HandleTypeDef *hpcd)
  \brief       Get USBD_RESOURCES_t strusture from PCD_HandleTypeDef
*/
static const USBD_RESOURCES_t * USBD_Resources (PCD_HandleTypeDef *hpcd) {
  const USBD_RESOURCES_t *usbd = NULL;

#if (OTG_FS_DEVICE_USED == 1)
  if (hpcd->Instance == USB_OTG_FS) { usbd = &USBD_FS_Resources; }
#endif
#if (OTG_HS_DEVICE_USED == 1)
  if (hpcd->Instance == USB_OTG_HS) { usbd = &USBD_HS_Resources; }
#endif

  return usbd;
}


