cmjang/CtrBoard-H7_IMU_Altitude/AC6_Code/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Driver/USBD_STM32H7xx.c
// USBD Driver functions

/**
  \fn          ARM_DRIVER_VERSION USBD_GetVersion (void)
  \brief       Get driver version.
  \return      \ref ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION USBD_GetVersion (void) { return usbd_driver_version; }

/**
  \fn          ARM_USBD_CAPABILITIES USBD_GetCapabilities (const USBD_RESOURCES_t *usbd)
  \brief       Get driver capabilities.
  \param[in]   usbd  Pointer to USB_OTG resources
  \return      \ref ARM_USBD_CAPABILITIES
*/
static ARM_USBD_CAPABILITIES USBD_GetCapabilities (const USBD_RESOURCES_t *usbd) {
  ARM_USBD_CAPABILITIES cap ={0U};
#if (OTG_FS_DEVICE_USED == 1)
  if (usbd->p_hpcd->Instance == USB_OTG_FS) { return usbd_fs_driver_capabilities; }
#endif
#if (OTG_HS_DEVICE_USED == 1)
  if (usbd->p_hpcd->Instance == USB_OTG_HS) { return usbd_hs_driver_capabilities; }
#endif
return cap;
}

/**
  \fn          int32_t USBD_Initialize (ARM_USBD_SignalDeviceEvent_t    cb_device_event,
                                        ARM_USBD_SignalEndpointEvent_t  cb_endpoint_event
                                        const USBD_RESOURCES_t         *usbd)
  \brief       Initialize USB Device Interface.
  \param[in]   cb_device_event    Pointer to \ref ARM_USBD_SignalDeviceEvent
  \param[in]   cb_endpoint_event  Pointer to \ref ARM_USBD_SignalEndpointEvent
  \param[in]   usbd                Pointer to USB_OTG resources
  \return      \ref execution_status
*/
static int32_t USBD_Initialize (ARM_USBD_SignalDeviceEvent_t    cb_device_event,
                                ARM_USBD_SignalEndpointEvent_t  cb_endpoint_event,
                                const USBD_RESOURCES_t         *usbd) {

  if (usbd->info->hw_initialized == true) {
    return ARM_DRIVER_OK;
  }

  usbd->info->cb_device_event   = cb_device_event;
  usbd->info->cb_endpoint_event = cb_endpoint_event;

  *usbd->p_otg_role          = ARM_USB_ROLE_DEVICE;
  usbd->info->hw_initialized = true;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_Uninitialize (const USBD_RESOURCES_t *usbd)
  \brief       De-initialize USB Device Interface.
  \param[in]   usbd  Pointer to USB_OTG resources
  \return      \ref execution_status
*/
static int32_t USBD_Uninitialize (const USBD_RESOURCES_t *usbd) {

  usbd->p_hpcd->Instance     = NULL;
  *usbd->p_otg_role          = ARM_USB_ROLE_NONE;
  usbd->info->hw_initialized = false;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_PowerControl (ARM_POWER_STATE         state,
                                          const USBD_RESOURCES_t *usbd)
  \brief       Control USB Device Interface Power.
  \param[in]   state  Power state
  \param[in]   usbd   Pointer to USB_OTG resources
  \return      \ref execution_status
*/
static int32_t USBD_PowerControl (ARM_POWER_STATE         state,
                                  const USBD_RESOURCES_t *usbd) {

  if ((state != ARM_POWER_OFF)  &&
      (state != ARM_POWER_FULL) &&
      (state != ARM_POWER_LOW)) {
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  switch (state) {
    case ARM_POWER_OFF:
      NVIC_DisableIRQ ((IRQn_Type)usbd->irqn);

      // Deinitialize
      HAL_PCD_DeInit(usbd->p_hpcd);

      // Clear powered flag
      usbd->info->hw_powered = false;
      break;

    case ARM_POWER_FULL:
      if (usbd->info->hw_initialized == false) {
        return ARM_DRIVER_ERROR;
      }
      if (usbd->info->hw_powered == true) {
        return ARM_DRIVER_OK;
      }

      // Set powered flag
      usbd->info->hw_powered = true;

      // Initialize
#if (OTG_FS_DEVICE_USED == 1)
      if (usbd == &USBD_FS_Resources) {
        usbd->p_hpcd->Instance = USB_OTG_FS;
        usbd->p_hpcd->Init.dev_endpoints = USBD_FS_MAX_ENDPOINT_NUM;
        usbd->p_hpcd->Init.use_dedicated_ep1 = 0;
        usbd->p_hpcd->Init.ep0_mps = 0x40;
        usbd->p_hpcd->Init.low_power_enable = 0;
        usbd->p_hpcd->Init.phy_itface = PCD_PHY_EMBEDDED;
        usbd->p_hpcd->Init.Sof_enable = 0;
        usbd->p_hpcd->Init.speed = PCD_SPEED_FULL;
#ifdef MX_USB_OTG_FS_VBUS_Pin
        usbd->p_hpcd->Init.vbus_sensing_enable = 1;
#else
        usbd->p_hpcd->Init.vbus_sensing_enable = 0;
#endif
        usbd->p_hpcd->Init.lpm_enable = 0;
        usbd->p_hpcd->pData = NULL;
      }
#endif
#if (OTG_HS_DEVICE_USED == 1)
      if (usbd == &USBD_HS_Resources) {
        usbd->p_hpcd->Instance = USB_OTG_HS;
        usbd->p_hpcd->Init.dev_endpoints = USBD_HS_MAX_ENDPOINT_NUM;
        usbd->p_hpcd->Init.use_dedicated_ep1 = 0;
        usbd->p_hpcd->Init.ep0_mps = 0x40;
        usbd->p_hpcd->Init.low_power_enable = 0;
#if (OTG_HS_IN_FS == 1)
        usbd->p_hpcd->Init.phy_itface = PCD_PHY_EMBEDDED;
#else
        usbd->p_hpcd->Init.phy_itface = PCD_PHY_ULPI;
#endif
        usbd->p_hpcd->Init.Sof_enable = 0;
        usbd->p_hpcd->Init.speed = PCD_SPEED_HIGH;
        usbd->p_hpcd->Init.dma_enable = DISABLE;
        usbd->p_hpcd->Init.vbus_sensing_enable = 1;
        usbd->p_hpcd->Init.lpm_enable = 0;
        usbd->p_hpcd->pData = NULL;
      }
#endif
      HAL_PCD_Init (usbd->p_hpcd);

#if (OTG_FS_DEVICE_USED == 1)
    if (usbd == &USBD_FS_Resources) {
      HAL_PWREx_EnableUSBVoltageDetector();

      HAL_PCDEx_SetRxFiFo(usbd->p_hpcd,    OTG_FS_RX_FIFO_SIZE  / 4);
      HAL_PCDEx_SetTxFiFo(usbd->p_hpcd, 0, OTG_FS_TX0_FIFO_SIZE / 4);
      HAL_PCDEx_SetTxFiFo(usbd->p_hpcd, 1, OTG_FS_TX1_FIFO_SIZE / 4);
      HAL_PCDEx_SetTxFiFo(usbd->p_hpcd, 2, OTG_FS_TX2_FIFO_SIZE / 4);
      HAL_PCDEx_SetTxFiFo(usbd->p_hpcd, 3, OTG_FS_TX3_FIFO_SIZE / 4);
      HAL_PCDEx_SetTxFiFo(usbd->p_hpcd, 4, OTG_FS_TX4_FIFO_SIZE / 4);
      HAL_PCDEx_SetTxFiFo(usbd->p_hpcd, 5, OTG_FS_TX5_FIFO_SIZE / 4);
      HAL_PCDEx_SetTxFiFo(usbd->p_hpcd, 6, OTG_FS_TX6_FIFO_SIZE / 4);
      HAL_PCDEx_SetTxFiFo(usbd->p_hpcd, 7, OTG_FS_TX7_FIFO_SIZE / 4);
      HAL_PCDEx_SetTxFiFo(usbd->p_hpcd, 8, OTG_FS_TX8_FIFO_SIZE / 4);
    }
#endif

#if (OTG_HS_DEVICE_USED == 1)
    if (usbd == &USBD_HS_Resources) {
#if (OTG_HS_IN_FS == 1)
      HAL_PWREx_EnableUSBVoltageDetector();
#endif
      HAL_PCDEx_SetRxFiFo(usbd->p_hpcd,    OTG_HS_RX_FIFO_SIZE  / 4);
      HAL_PCDEx_SetTxFiFo(usbd->p_hpcd, 0, OTG_HS_TX0_FIFO_SIZE / 4);
      HAL_PCDEx_SetTxFiFo(usbd->p_hpcd, 1, OTG_HS_TX1_FIFO_SIZE / 4);
      HAL_PCDEx_SetTxFiFo(usbd->p_hpcd, 2, OTG_HS_TX2_FIFO_SIZE / 4);
      HAL_PCDEx_SetTxFiFo(usbd->p_hpcd, 3, OTG_HS_TX3_FIFO_SIZE / 4);
      HAL_PCDEx_SetTxFiFo(usbd->p_hpcd, 4, OTG_HS_TX4_FIFO_SIZE / 4);
      HAL_PCDEx_SetTxFiFo(usbd->p_hpcd, 5, OTG_HS_TX5_FIFO_SIZE / 4);
      HAL_PCDEx_SetTxFiFo(usbd->p_hpcd, 6, OTG_HS_TX6_FIFO_SIZE / 4);
      HAL_PCDEx_SetTxFiFo(usbd->p_hpcd, 7, OTG_HS_TX7_FIFO_SIZE / 4);
      HAL_PCDEx_SetTxFiFo(usbd->p_hpcd, 8, OTG_HS_TX8_FIFO_SIZE / 4);
    }
#endif

      NVIC_EnableIRQ ((IRQn_Type)usbd->irqn);
      break;

    case ARM_POWER_LOW:
      return ARM_DRIVER_ERROR_UNSUPPORTED;
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_DeviceConnect (const USBD_RESOURCES_t *usbd)
  \brief       Connect USB Device.
  \param[in]   usbd Pointer to USB_OTG resources
  \return      \ref execution_status
*/
static int32_t USBD_DeviceConnect (const USBD_RESOURCES_t *usbd) {

  if (usbd->info->hw_powered == false) { return ARM_DRIVER_ERROR; }

  HAL_PCD_Start(usbd->p_hpcd);

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_DeviceDisconnect (const USBD_RESOURCES_t *usbd)
  \brief       Disconnect USB Device.
  \param[in]   usbd  Pointer to USB_OTG resources
  \return      \ref execution_status
*/
static int32_t USBD_DeviceDisconnect (const USBD_RESOURCES_t *usbd) {

  if (usbd->info->hw_powered == false) { return ARM_DRIVER_ERROR; }

  HAL_PCD_DevDisconnect(usbd->p_hpcd);

  return ARM_DRIVER_OK;
}

/**
  \fn          ARM_USBD_STATE USBD_DeviceGetState (const USBD_RESOURCES_t *usbd)
  \brief       Get current USB Device State.
  \param[in]   usbd  Pointer to USB_OTG resources
  \return      Device State \ref ARM_USBD_STATE
*/
static ARM_USBD_STATE USBD_DeviceGetState (const USBD_RESOURCES_t *usbd) {
  return usbd->info->state;
}

/**
  \fn          int32_t USBD_DeviceRemoteWakeup (const USBD_RESOURCES_t *usbd)
  \brief       Trigger USB Remote Wakeup.
  \param[in]   usbd  Pointer to USB_OTG resources
  \return      \ref execution_status
*/
static int32_t USBD_DeviceRemoteWakeup (const USBD_RESOURCES_t *usbd) {

  if (usbd->info->hw_powered == false) { return ARM_DRIVER_ERROR; }

  HAL_PCD_ActivateRemoteWakeup(usbd->p_hpcd);

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_DeviceSetAddress (uint8_t                 dev_addr,
                                              const USBD_RESOURCES_t *usbd)
  \brief       Set USB Device Address.
  \param[in]   dev_addr  Device Address
  \param[in]   usbd      Pointer to USB_OTG resources
  \return      \ref execution_status
*/
static int32_t USBD_DeviceSetAddress (uint8_t                 dev_addr,
                                      const USBD_RESOURCES_t *usbd) {

  if (usbd->info->hw_powered == false) { return ARM_DRIVER_ERROR; }

  HAL_PCD_SetAddress(usbd->p_hpcd, dev_addr);

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_ReadSetupPacket (uint8_t                *setup,
                                             const USBD_RESOURCES_t *usbd)
  \brief       Read setup packet received over Control Endpoint.
  \param[out]  setup  Pointer to buffer for setup packet
  \param[in]   usbd   Pointer to USB_OTG resources
  \return      \ref execution_status
*/
static int32_t USBD_ReadSetupPacket (uint8_t                *setup,
                                     const USBD_RESOURCES_t *usbd) {

  if (usbd->info->hw_powered == false)  { return ARM_DRIVER_ERROR; }
  if (usbd->info->setup_received == 0U) { return ARM_DRIVER_ERROR; }

  usbd->info->setup_received = 0U;
  memcpy(setup, usbd->p_setup_packet, 8);

  // If new setup packet was received while this was being read
  if (usbd->info->setup_received != 0U) {
    return ARM_DRIVER_ERROR;
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_EndpointConfigure (uint8_t                ep_addr,
                                               uint8_t                ep_type,
                                               uint16_t               ep_max_packet_size,
                                               const USBD_RESOURCES_t *usbd)
  \brief       Configure USB Endpoint.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[in]   ep_type  Endpoint Type (ARM_USB_ENDPOINT_xxx)
  \param[in]   ep_max_packet_size Endpoint Maximum Packet Size
  \param[in]   usbd  Pointer to USB_OTG resources
  \return      \ref execution_status
*/
static int32_t USBD_EndpointConfigure (uint8_t                ep_addr,
                                       uint8_t                ep_type,
                                       uint16_t               ep_max_packet_size,
                                       const USBD_RESOURCES_t *usbd) {
  uint8_t              ep_num;
  uint16_t             ep_mps;
  volatile ENDPOINT_t *ptr_ep;

