cmjang/CtrBoard-H7_IMU_Altitude/AC6_Code/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Driver/USBD_STM32H7xx.c
  ep_num = EP_NUM(ep_addr);
  ep_mps = ep_max_packet_size & ARM_USB_ENDPOINT_MAX_PACKET_SIZE_MASK;

  if (ep_num > usbd->max_ep_num)       { return ARM_DRIVER_ERROR_PARAMETER; }
  if ((ep_addr & ARM_USB_ENDPOINT_DIRECTION_MASK) == ARM_USB_ENDPOINT_DIRECTION_MASK) { // IN endpoint
    if (ep_mps > usbd->tx_fifo_size[ep_num])                          { return ARM_DRIVER_ERROR_PARAMETER; }
  } else {                                                                              // OUT endpoint
    if ((ep_mps + 60U + (8 * usbd->max_ep_num)) > usbd->rx_fifo_size) { return ARM_DRIVER_ERROR_PARAMETER; }
  }
  if (usbd->info->hw_powered == false) { return ARM_DRIVER_ERROR; }

  ptr_ep = &usbd->ep[EP_ID(ep_addr)];
  if (ptr_ep->active != 0U)            { return ARM_DRIVER_ERROR_BUSY; }

  // Clear Endpoint transfer and configuration information
  memset((void *)((uint32_t)ptr_ep), 0, sizeof (ENDPOINT_t));

  // Set maximum packet size to requested
  ptr_ep->max_packet_size = ep_mps;

  HAL_PCD_EP_Open(usbd->p_hpcd, ep_addr, ep_mps, ep_type);

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_EndpointUnconfigure (uint8_t                 ep_addr,
                                                 const USBD_RESOURCES_t *usbd)
  \brief       Unconfigure USB Endpoint.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction

  \param[in]   usbd  Pointer to USB_OTG resources
  \return      \ref execution_status
*/
static int32_t USBD_EndpointUnconfigure (uint8_t                 ep_addr,
                                         const USBD_RESOURCES_t *usbd) {
  uint8_t              ep_num;
  volatile ENDPOINT_t *ptr_ep;

  ep_num = EP_NUM(ep_addr);
  if (ep_num > usbd->max_ep_num)       { return ARM_DRIVER_ERROR_PARAMETER; }
  if (usbd->info->hw_powered == false) { return ARM_DRIVER_ERROR; }

  ptr_ep = &usbd->ep[EP_ID(ep_addr)];
  if (ptr_ep->active != 0U)            { return ARM_DRIVER_ERROR_BUSY; }

  // Clear Endpoint transfer and configuration information
  memset((void *)((uint32_t)ptr_ep), 0, sizeof (ENDPOINT_t));

  HAL_PCD_EP_Close(usbd->p_hpcd, ep_addr);

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_EndpointStall (uint8_t                 ep_addr,
                                           bool                    stall,
                                           const USBD_RESOURCES_t *usbd)
  \brief       Set/Clear Stall for USB Endpoint.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[in]   stall  Operation
                - \b false Clear
                - \b true Set
  \param[in]   usbd  Pointer to USB_OTG resources
  \return      \ref execution_status
*/
static int32_t USBD_EndpointStall (uint8_t                 ep_addr,
                                   bool                    stall,
                                   const USBD_RESOURCES_t *usbd) {
  uint8_t ep_num;

  ep_num = EP_NUM(ep_addr);
  if (ep_num > usbd->max_ep_num)       { return ARM_DRIVER_ERROR_PARAMETER; }
  if (usbd->info->hw_powered == false) { return ARM_DRIVER_ERROR; }

  if (stall != 0U) {
    // Set STALL
    HAL_PCD_EP_SetStall(usbd->p_hpcd, ep_addr);
  } else {
    // Clear STALL
    HAL_PCD_EP_ClrStall(usbd->p_hpcd, ep_addr);
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_EndpointTransfer (uint8_t                 ep_addr,
                                              uint8_t                *data,
                                              uint32_t                num,
                                              const USBD_RESOURCES_t *usbd)
  \brief       Read data from or Write data to USB Endpoint.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[out]  data Pointer to buffer for data to read or with data to write
  \param[in]   num  Number of data bytes to transfer
  \param[in]   usbd  Pointer to USB_OTG resources
  \return      \ref execution_status
*/
static int32_t USBD_EndpointTransfer (uint8_t                 ep_addr,
                                      uint8_t                *data,
                                      uint32_t                num,
                                      const USBD_RESOURCES_t *usbd) {
  uint8_t              ep_num;
  bool                 ep_dir;
  volatile ENDPOINT_t *ptr_ep;

  ep_num = EP_NUM(ep_addr);
  if (ep_num > usbd->max_ep_num)       { return ARM_DRIVER_ERROR_PARAMETER; }
  if (usbd->info->hw_powered == false) { return ARM_DRIVER_ERROR; }


  ptr_ep = &usbd->ep[EP_ID(ep_addr)];
  if (ptr_ep->active != 0U)            { return ARM_DRIVER_ERROR_BUSY; }

  ep_dir = (ep_addr & ARM_USB_ENDPOINT_DIRECTION_MASK) == ARM_USB_ENDPOINT_DIRECTION_MASK;

  ptr_ep->active = 1U;

  ptr_ep->data                  = data;
  ptr_ep->num                   = num;
  ptr_ep->num_transferred_total = 0U;
  ptr_ep->num_transferring      = num;

  if ((ep_addr & 0x7F) == 0) {
    // Only for EP0
    if (ptr_ep->max_packet_size < num) {
      ptr_ep->num_transferring = ptr_ep->max_packet_size;
    }
  }

  if (ep_dir != 0U) {
    // IN Endpoint
    HAL_PCD_EP_Transmit(usbd->p_hpcd, ep_addr, (uint8_t *)data, ptr_ep->num_transferring);
  } else {
    // OUT Endpoint
    HAL_PCD_EP_Receive(usbd->p_hpcd, ep_addr, (uint8_t *)data, ptr_ep->num_transferring);
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          uint32_t USBD_EndpointTransferGetResult (uint8_t                 ep_addr,
                                                        const USBD_RESOURCES_t *usbd)
  \brief       Get result of USB Endpoint transfer.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[in]   usbd  Pointer to USB_OTG resources
  \return      number of successfully transferred data bytes
*/
static uint32_t USBD_EndpointTransferGetResult (uint8_t                 ep_addr,
                                                const USBD_RESOURCES_t *usbd) {
  volatile ENDPOINT_t *ptr_ep;

  ptr_ep = &usbd->ep[EP_ID(ep_addr)];
  return (ptr_ep->num_transferred_total);
}

/**
  \fn          int32_t USBD_EndpointTransferAbort (uint8_t                 ep_addr,
                                                   const USBD_RESOURCES_t *usbd)
  \brief       Abort current USB Endpoint transfer.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[in]   usbd  Pointer to USB_OTG resources
  \return      \ref execution_status
*/
static int32_t USBD_EndpointTransferAbort (uint8_t                 ep_addr,
                                           const USBD_RESOURCES_t *usbd) {
           uint8_t       ep_num;
  volatile ENDPOINT_t   *ptr_ep;
  volatile uint32_t      tout;
           uint32_t      USBx_BASE;

