cmjang/CtrBoard-H7_IMU_Altitude/AC6_Code/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Driver/USBD_STM32H7xx.c
  ep_num = EP_NUM(ep_addr);
  if (ep_num > usbd->max_ep_num)       { return ARM_DRIVER_ERROR_PARAMETER; }
  if (usbd->info->hw_powered == false) { return ARM_DRIVER_ERROR; }

  USBx_BASE = (uint32_t)usbd->p_hpcd->Instance;
  if (ep_addr &  0x80) {
    USBx_INEP(ep_num)->DIEPCTL |= USB_OTG_DIEPCTL_SNAK;

    // Wait until core starts transmitting NAK handshakes
    tout = 1000;
    while (((USBx_INEP(ep_num)->DIEPCTL & USB_OTG_DIEPCTL_NAKSTS) == 0) && (tout-- != 0)) {
      __NOP();
    }
    HAL_PCD_EP_Flush(usbd->p_hpcd, ep_addr);
  } else {
    USBx_OUTEP(ep_num)->DOEPCTL |= USB_OTG_DOEPCTL_SNAK;
  }

  ptr_ep = &usbd->ep[EP_ID(ep_addr)];
  ptr_ep->active = 0U;

  return ARM_DRIVER_OK;
}

/**
  \fn          uint16_t USBD_GetFrameNumber (const USBD_RESOURCES_t *usbd)
  \brief       Get current USB Frame Number.
  \param[in]   usbd  Pointer to USB_OTG resources
  \return      Frame Number
*/
static uint16_t USBD_GetFrameNumber (const USBD_RESOURCES_t *usbd) {

  if (usbd->info->hw_powered == false) { return 0U; }
  return ((uint16_t)USB_GetCurrentFrame(usbd->p_hpcd->Instance));
}

// Callbacks from HAL
/**
  * @brief  Data OUT stage callback.
  * @param  hpcd: PCD handle
  * @param  epnum: endpoint number
  * @retval None
  */
void HAL_PCD_DataOutStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum) {
  uint32_t             cnt;
  volatile ENDPOINT_t *ptr_ep;
  const    USBD_RESOURCES_t * usbd;

  usbd = USBD_Resources(hpcd);
  ptr_ep = &usbd->ep[EP_ID(epnum)];

  if (epnum != 0) {
    if (usbd->info->cb_endpoint_event != NULL) {
      ptr_ep->active = 0U;
      ptr_ep->num_transferred_total = HAL_PCD_EP_GetRxCount(hpcd, epnum);
      usbd->info->cb_endpoint_event(epnum, ARM_USBD_EVENT_OUT);
    }
  } else {
    cnt = HAL_PCD_EP_GetRxCount(hpcd, epnum);
    ptr_ep->num_transferred_total += cnt;
    if ((cnt < ptr_ep->max_packet_size) || (ptr_ep->num_transferred_total == ptr_ep->num)) {
      if (usbd->info->cb_endpoint_event != NULL) {
        ptr_ep->active = 0U;
         usbd->info->cb_endpoint_event(epnum, ARM_USBD_EVENT_OUT);
      }
    } else {
      ptr_ep->num_transferring = ptr_ep->num - ptr_ep->num_transferred_total;
      if (ptr_ep->num_transferring > ptr_ep->max_packet_size) {
        ptr_ep->num_transferring = ptr_ep->max_packet_size;
      }
      HAL_PCD_EP_Receive(usbd->p_hpcd, epnum, (uint8_t *)(ptr_ep->data + ptr_ep->num_transferred_total), ptr_ep->num_transferring);
    }
  }
}

/**
  * @brief  Data IN stage callback.
  * @param  hpcd: PCD handle
  * @param  epnum: endpoint number
  * @retval None
  */
void HAL_PCD_DataInStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum) {
  volatile ENDPOINT_t *ptr_ep;
  const    USBD_RESOURCES_t * usbd;

  usbd = USBD_Resources(hpcd);
  ptr_ep = &usbd->ep[EP_ID(epnum | 0x80)];

  ptr_ep->num_transferred_total += ptr_ep->num_transferring;
  if (epnum != 0) {
    if ( usbd->info->cb_endpoint_event != NULL) {
      ptr_ep->active = 0U;
       usbd->info->cb_endpoint_event(epnum | ARM_USB_ENDPOINT_DIRECTION_MASK, ARM_USBD_EVENT_IN);
    }
  } else {
    // EP0
    if(ptr_ep->num_transferred_total == ptr_ep->num) {
      if (usbd->info->cb_endpoint_event != NULL) {
        ptr_ep->active = 0U;
        usbd->info->cb_endpoint_event(epnum | ARM_USB_ENDPOINT_DIRECTION_MASK, ARM_USBD_EVENT_IN);
      }
    } else {
      ptr_ep->num_transferring = ptr_ep->num - ptr_ep->num_transferred_total;
      if (ptr_ep->num_transferring > ptr_ep->max_packet_size) {
        ptr_ep->num_transferring = ptr_ep->max_packet_size;
      }
        HAL_PCD_EP_Transmit(usbd->p_hpcd, epnum | 0x80, (uint8_t *)(ptr_ep->data + ptr_ep->num_transferred_total), ptr_ep->num_transferring);
    }
  }
}
/**
  * @brief  Setup stage callback.
  * @param  hpcd: PCD handle
  * @retval None
  */
void HAL_PCD_SetupStageCallback(PCD_HandleTypeDef *hpcd) {
  const USBD_RESOURCES_t * usbd;

  usbd = USBD_Resources(hpcd);

  memcpy(usbd->p_setup_packet, hpcd->Setup, 8);
  usbd->info->setup_received = 1;

  // Analyze Setup packet for SetAddress
  if ((*usbd->p_setup_packet & 0xFFFFU) == 0x0500U) {
    USBD_DeviceSetAddress((*usbd->p_setup_packet >> 16) & 0xFFU, usbd);
  }

  if (usbd->info->cb_endpoint_event != NULL) {
    usbd->info->cb_endpoint_event(0, ARM_USBD_EVENT_SETUP);
  }
}

/**
  * @brief  USB Reset callback.
  * @param  hpcd: PCD handle
  * @retval None
  */
void HAL_PCD_ResetCallback(PCD_HandleTypeDef *hpcd) {
  const USBD_RESOURCES_t * usbd;
  usbd = USBD_Resources(hpcd);

  memset((void *)((uint32_t)usbd->ep), 0U, sizeof(ENDPOINT_t) * usbd->max_ep_num * 2);
  memset((void *)((uint32_t)&usbd->info->state), 0, sizeof(ARM_USBD_STATE));

  if (usbd->info->cb_device_event != NULL) {
    usbd->info->cb_device_event(ARM_USBD_EVENT_RESET);
  }

  // USB Speed
  switch (hpcd->Init.speed)
  {
  case PCD_SPEED_HIGH:
    usbd->info->state.speed = ARM_USB_SPEED_HIGH;
    if (usbd->info->cb_device_event != NULL) {
      usbd->info->cb_device_event(ARM_USBD_EVENT_HIGH_SPEED );
    }
    break;

  case PCD_SPEED_FULL:
  default:
    usbd->info->state.speed = ARM_USB_SPEED_FULL;
    break;
  }

  HAL_PCD_EP_Open(usbd->p_hpcd, 0x80, 64, 0);
  HAL_PCD_EP_Open(usbd->p_hpcd, 0x00, 64, 0);
}

/**
  * @brief  Suspend event callback.
  * @param  hpcd: PCD handle
  * @retval None
  */
void HAL_PCD_SuspendCallback(PCD_HandleTypeDef *hpcd) {
  const USBD_RESOURCES_t * usbd;

  usbd = USBD_Resources(hpcd);

  if (usbd->info->cb_device_event != NULL) {
    usbd->info->cb_device_event(ARM_USBD_EVENT_SUSPEND);
  }
}

/**
  * @brief  Resume event callback.
  * @param  hpcd: PCD handle
  * @retval None
  */
void HAL_PCD_ResumeCallback(PCD_HandleTypeDef *hpcd) {
  const USBD_RESOURCES_t * usbd;

  usbd = USBD_Resources(hpcd);

  if (usbd->info->cb_device_event != NULL) {
    usbd->info->cb_device_event(ARM_USBD_EVENT_RESUME);
  }
}

/**
  * @brief  Incomplete ISO OUT callback.
  * @param  hpcd: PCD handle
  * @param  epnum: endpoint number
  * @retval None
  */
void HAL_PCD_ISOOUTIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum) {
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);
  UNUSED(epnum);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_PCD_ISOOUTIncompleteCallback could be implemented in the user file
   */
}

/**
  * @brief  Incomplete ISO IN callback.
  * @param  hpcd: PCD handle
  * @param  epnum: endpoint number
  * @retval None
  */
void HAL_PCD_ISOINIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum) {
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);
  UNUSED(epnum);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_PCD_ISOINIncompleteCallback could be implemented in the user file
   */
}

/**
  * @brief  Connection event callback.
  * @param  hpcd: PCD handle
  * @retval None
  */
void HAL_PCD_ConnectCallback(PCD_HandleTypeDef *hpcd) {
  const USBD_RESOURCES_t * usbd;

  usbd = USBD_Resources(hpcd);

  if (usbd->info->cb_device_event != NULL) {
    usbd->info->cb_device_event(ARM_USBD_EVENT_VBUS_ON);
  }
}

/**
  * @brief  Disconnection event callback.
  * @param  hpcd: PCD handle
  * @retval None
  */
void HAL_PCD_DisconnectCallback(PCD_HandleTypeDef *hpcd) {
  const USBD_RESOURCES_t * usbd;

  usbd = USBD_Resources(hpcd);

  if (usbd->info->cb_device_event != NULL) {
    usbd->info->cb_device_event(ARM_USBD_EVENT_VBUS_OFF);
  }
}

#if (OTG_FS_DEVICE_USED == 1)
USBDx_EXPORT_DRIVER(0, FS);
#endif

#if (OTG_HS_DEVICE_USED == 1)
USBDx_EXPORT_DRIVER(1, HS);
#endif

/*! \endcond */
